; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v4 ?v5)
             (pred_11 ?v9 ?v1)
             (pred_5 ?v4 ?v1)
             (pred_8 ?v12 ?v4 )
	     (pred_6 ?v4)
             (pred_10 ?v11)
             (pred_3 ?v9)
             (pred_1 ?v1)
             (pred_7 ?v4)
             (pred_12 ?v9)
             (pred_4 ?v4)
             (pred_2 ))



(:action op_3
:parameters (?v6 ?v3 ?v7 ?v13)
:precondition (and (pred_10 ?v6) (pred_10 ?v3) (pred_3 ?v7) (pred_1 ?v13)
          (pred_9 ?v6 ?v3) (pred_11 ?v7 ?v13)
                   (pred_5 ?v3 ?v13) (pred_6 ?v6) 
                   (pred_7 ?v3) (pred_12 ?v7))
:effect (and  (pred_4 ?v3) (not (pred_7 ?v3))))


(:action op_5
:parameters (?v6 ?v2)
:precondition (and (pred_10 ?v6) (pred_10 ?v2)
               (pred_6 ?v6) (pred_9 ?v6 ?v2) (pred_4 ?v2))
:effect (and (pred_6 ?v2) (not (pred_6 ?v6))))

(:action op_2
:parameters (?v6 ?v7)
:precondition (and (pred_10 ?v6) (pred_3 ?v7) 
                  (pred_6 ?v6) (pred_8 ?v7 ?v6) (pred_2 ))
:effect (and (pred_12 ?v7)
   (not (pred_8 ?v7 ?v6)) (not (pred_2 ))))


(:action op_1
:parameters (?v6 ?v10 ?v8)
:precondition (and (pred_10 ?v6) (pred_3 ?v10) (pred_3 ?v8)
                  (pred_6 ?v6) (pred_12 ?v8) (pred_8 ?v10 ?v6))
:effect (and (pred_12 ?v10) (pred_8 ?v8 ?v6)
        (not (pred_12 ?v8)) (not (pred_8 ?v10 ?v6))))

(:action op_4
:parameters (?v6 ?v7)
:precondition (and (pred_10 ?v6) (pred_3 ?v7) 
                  (pred_6 ?v6) (pred_12 ?v7))
:effect (and (pred_2 ) (pred_8 ?v7 ?v6) (not (pred_12 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_04 obj_15 obj_05 obj_11 obj_12 obj_18 obj_19 obj_06 obj_01 obj_02 obj_14 obj_03 obj_07 obj_08 obj_13
    obj_10 obj_09
    obj_16 obj_20
    )

    (:init
       (pred_2)

       (pred_10 obj_17)
       (pred_10 obj_04)
       (pred_10 obj_15)
       (pred_10 obj_05)
       (pred_10 obj_11)
       (pred_10 obj_12)
       (pred_10 obj_18)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_01)
       (pred_10 obj_02)
       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_3 obj_16)
       (pred_3 obj_20)

       (pred_9 obj_17 obj_11)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_04 obj_12)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_15 obj_18)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_17)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_18)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_18 obj_15)
       (pred_9 obj_18 obj_12)
       (pred_9 obj_19 obj_14)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_01)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_06)
       (pred_9 obj_02 obj_08)
       (pred_9 obj_02 obj_14)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_14 obj_19)
       (pred_9 obj_14 obj_02)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_08 obj_02)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_13 obj_08)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_5  obj_17 obj_10)
       (pred_5  obj_04 obj_09)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_4 obj_12)
       (pred_4 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_01)
       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_13)

       (pred_11  obj_16 obj_10)
       (pred_11  obj_20 obj_09)
       (pred_8 obj_16 obj_19)
       (pred_8 obj_20 obj_14)
       (pred_6 obj_08)
    )

    (:goal (and
       (pred_8 obj_20 obj_18)
    ))
(:constraints
  (always (not (pred_6 obj_02)))
)
)

; plan
1. (op_5 obj_08 obj_13)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_13)
   goals met: 0 of 1
2. (op_5 obj_13 obj_14)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_14)
   goals met: 0 of 1
3. (op_2 obj_14 obj_20)
   deleted: (pred_8 obj_20 obj_14) (pred_2)
   added: (pred_12 obj_20)
   goals met: 0 of 1
4. (op_5 obj_14 obj_19)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_18)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_18)
   goals met: 0 of 1
6. (op_4 obj_18 obj_20)
   deleted: (pred_12 obj_20)
   added: (pred_2) (pred_8 obj_20 obj_18)
   goals met: 1 of 1
